# 替代值

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.Series([1., -999., 2., -999., -1000, 3.])

In [3]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [4]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

## 用字典替换

In [6]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

<br><br>
# 重命名索引

In [9]:
df = pd.DataFrame(np.arange(12).reshape(3, 4),
                 index = ['Ohio', 'Colorado', 'New York'],
                 columns = ['one', 'two', 'three', 'four'])

In [10]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [14]:
transform = lambda x: x[:4].upper()

In [19]:
transform

In [16]:
df.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [17]:
df.index = df.index.map(transform)

In [18]:
df

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

## 不修改原有的数据集，返回备份

In [21]:
df.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [22]:
df.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [24]:
df.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [25]:
df

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11